EbadSyed/v2.1/app/mcu_example/SLSTK3701A_EFM32GG11/micriumos_net/net/core/ex_net_core.c
/*
*********************************************************************************************************
*                                             EXAMPLE CODE
*********************************************************************************************************
* Licensing terms:
*   This file is provided as an example on how to use Micrium products. It has not necessarily been
*   tested under every possible condition and is only offered as a reference, without any guarantee.
*
*   Please feel free to use any application code labeled as 'EXAMPLE CODE' in your application products.
*   Example code may be used as is, in whole or in part, or may be used as a reference only. This file
*   can be modified as required.
*
*   You can find user manuals, API references, release notes and more at: https://doc.micrium.com
*
*   You can contact us at: http://www.micrium.com
*
*   Please help us continue to provide the Embedded community with the finest software available.
*
*   Your honesty is greatly appreciated.
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*
*                                   EXAMPLE NETWORK CORE INITIALISATION
*                                        ETHERNET INTERFACE
*
* File : ex_net_core.c
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*********************************************************************************************************
*                                     DEPENDENCIES & AVAIL CHECK(S)
*********************************************************************************************************
*********************************************************************************************************
*/

#include  <rtos_description.h>

#if (defined(RTOS_MODULE_NET_AVAIL))


/*
*********************************************************************************************************
*********************************************************************************************************
*                                            INCLUDE FILES
*********************************************************************************************************
*********************************************************************************************************
*/

#include  "ex_description.h"

#include  <net_cfg.h>

#include  <rtos/cpu/include/cpu.h>
#include  <rtos/common/include/lib_str.h>
#include  <rtos/common/include/lib_mem.h>
#include  <rtos/common/include/rtos_err.h>
#include  <rtos/common/include/rtos_utils.h>

#include  <rtos/net/include/net.h>
#include  <rtos/net/include/net_type.h>
#include  <rtos/net/include/net_if.h>
#include  <rtos/net/include/net_ascii.h>
#include  <rtos/net/include/dhcp_client.h>
#include  <rtos/net/include/dhcp_client_types.h>
#include  <rtos/net/include/net_ipv4.h>
#include  <rtos/net/include/net_ipv6.h>
#include  <rtos/net/include/net_if_ether.h>

#ifdef  RTOS_MODULE_NET_IF_LOOPBACK_AVAIL
#include  <rtos/net/include/net_if_loopback.h>
#endif

#include "em_device.h"

/*
*********************************************************************************************************
*********************************************************************************************************
*                                               LOGGING
*
* Note(s) : (1) This example outputs information to the console via the function printf() via a macro
*               called EX_TRACE(). This can be modified or disabled if printf() is not supported.
*********************************************************************************************************
*********************************************************************************************************
*/

#ifndef EX_TRACE
#include  <stdio.h>
#define  EX_TRACE(...)                                      printf(__VA_ARGS__)
#endif


/*
*********************************************************************************************************
*********************************************************************************************************
*                                               DEFINES
*********************************************************************************************************
*********************************************************************************************************
*/

#if (defined(RTOS_MODULE_NET_IF_ETHER_AVAIL) ||    \
     defined(RTOS_MODULE_NET_IF_WIFI_AVAIL))
#define  EX_NET_CORE_IF_EXT_EN
#endif


/*
*********************************************************************************************************
*********************************************************************************************************
*                                          GLOBAL VARIABLES
*********************************************************************************************************
*********************************************************************************************************
*/

#if (RTOS_CFG_EXTERNALIZE_OPTIONAL_CFG == DEF_ENABLED)
extern  const   NET_INIT_CFG  Net_InitCfgDflt;
#endif


/*
*********************************************************************************************************
*********************************************************************************************************
*                                      LOCAL FUNCTION PROTOTYPES
*********************************************************************************************************
*********************************************************************************************************
*/

#ifdef  EX_NET_CORE_IF_EXT_EN
static  void  Ex_IPv6_AddrCfgResult          (       NET_IF_NBR                  if_nbr,
                                                     NET_IPv6_CFG_ADDR_TYPE      addr_type,
                                              const  NET_IPv6_ADDR              *p_addr_cfgd,
                                                     NET_IPv6_ADDR_CFG_STATUS    addr_cfg_status);



static  void  Ex_DHCPc_SetupResult           (       NET_IF_NBR                  if_nbr,
                                                     DHCPc_STATUS                status,
                                                     NET_IPv4_ADDR               addr,
                                                     NET_IPv4_ADDR               mask,
                                                     NET_IPv4_ADDR               gateway,
                                                     RTOS_ERR                    err);

static  void  Ex_IPv4_LinkLocalAddrCfgResult (       NET_IF_NBR                  if_nbr,
                                                     NET_IPv4_ADDR               link_local_addr,
                                                     NET_IPv4_LINK_LOCAL_STATUS  status,
                                                     RTOS_ERR                    err);

#if ((NET_IPv4_CFG_EN == DEF_ENABLED) && \
     (NET_DHCP_CLIENT_CFG_MODULE_EN == DEF_ENABLED))
static  void  Ex_DHCPc_Hook                  (       NET_IF_NBR                  if_nbr,
                                                     DHCPc_STATUS                status,
                                                     NET_IPv4_ADDR               addr,
                                                     NET_IPv4_ADDR               mask,
                                                     NET_IPv4_ADDR               gateway,
                                                     RTOS_ERR                    err);
#endif
#endif

static void  Ex_MacAddrGet(CPU_CHAR * addr_mac_str);


