EbadSyed/v2.1/app/mcu_example/SLSTK3701A_EFM32GG11/micriumos_net/net/core/ex_net_core.c
/*
*********************************************************************************************************
*********************************************************************************************************
*                                       LOCAL GLOBAL VARIABLES
*********************************************************************************************************
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                 START SETUP FOR ETHERNET INTERFACE
*********************************************************************************************************
*/

static  const  NET_IF_ETHER_CFG  Ex_NetIF_CfgDflt_Ether = {
        // MAC Address will be loaded from DEVINFO when initializing interface
        .HW_AddrStr                    = "00:00:00:00:00:00",

        .IPv4.Static.Addr              = DEF_NULL,
        .IPv4.Static.Mask              = DEF_NULL,
        .IPv4.Static.Gateway           = DEF_NULL,

        .IPv4.DHCPc.En                 = DEF_YES,
        .IPv4.DHCPc.Cfg                = DHCPc_CFG_DFLT,
        .IPv4.DHCPc.OnCompleteHook     = Ex_DHCPc_SetupResult,

        .IPv4.LinkLocal.En             = DEF_NO,
        .IPv4.LinkLocal.OnCompleteHook = Ex_IPv4_LinkLocalAddrCfgResult,

        .IPv6.Static.Addr              = DEF_NULL,
        .IPv6.Static.PrefixLen         = 0,
        .IPv6.Static.DAD_En            = DEF_NO,
        .IPv6.AutoCfg.En               = DEF_YES,
        .IPv6.AutoCfg.DAD_En           = DEF_NO,
        .IPv6.Hook                     = Ex_IPv6_AddrCfgResult
};


/*
*********************************************************************************************************
*********************************************************************************************************
*                                          GLOBAL FUNCTIONS
*********************************************************************************************************
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                           Ex_Net_CoreInit()
*
* Description : Initialize the Network TCP-IP core and add an Ethernet Interface.
*
* Argument(s) : None.
*
* Return(s)   : None.
*
* Note(s)     : (1) Simplest initialization without any overwrite of default configuration.
*********************************************************************************************************
*/

void  Ex_Net_CoreInit (void)
{
    NET_IF_NBR  if_nbr;
    RTOS_ERR    err;


                                                                /* -------- INITIALIZE NETWORK TASKS & OBJECTS -------- */
    Net_Init(&err);
    APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE), ;);

#ifdef  RTOS_MODULE_NET_IF_LOOPBACK_AVAIL
                                                                /* -------------- ADD LOOPBACK INTERFACE -------------- */
    NetIF_Loopback_Init(DEF_NULL, &err);
    APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE), ;);
#endif

                                                                /* -------------- ADD ETHERNET INTERFACE -------------- */
    if_nbr = NetIF_Ether_Add("eth0",
                              DEF_NULL,
                              DEF_NULL,
                             &err);
    APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE), ;);
    printf("eth0: interface number %d\n", if_nbr);
}


/*
*********************************************************************************************************
*                                         Ex_Net_CoreStartIF()
*
* Description : Starts network interface(s).
*
* Argument(s) : None.
*
* Return(s)   : None.
*
* Note(s)     : (1) If the Ethernet module is available and the "eth0" was registered and added,
*                   this function will start that network interface.
*
*               (2) If the WiFi module is available and the "wifi0" was registered and added,
*                   this function will start that network interface.
*********************************************************************************************************
*/

void  Ex_Net_CoreStartIF (void)
{
    NET_IF_NBR         if_nbr;
    RTOS_ERR           err;
    NET_IF_ETHER_CFG   if_cfg_ether;
    CPU_CHAR           addr_mac_str[NET_IF_802x_ADDR_SIZE_STR];

                                                                /* ---------------- INTERFACE SETTINGS ---------------- */
                                                                /* Keep Default settings that enables DHCP client for   */
                                                                /* IPv4 and SLAAC for IPv6.                             */
    if_cfg_ether = Ex_NetIF_CfgDflt_Ether;
    Ex_MacAddrGet(addr_mac_str);
    if_cfg_ether.HW_AddrStr = addr_mac_str;

                                                                /* --- RECOVER INTERFACE NUMBER FROM INTEFACE NAME ---- */
    if_nbr = NetIF_NbrGetFromName("eth0");
    APP_RTOS_ASSERT_CRITICAL((if_nbr != NET_IF_NBR_NONE), ;);

                                                                /* ------------- START ETHERNET INTERFACE ------------- */
    printf("eth0: Starting interface=%d\n", if_nbr);
    NetIF_Ether_Start(if_nbr, &if_cfg_ether, &err);
    APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE), ;);
    printf("eth0: Interface started\n");


#if (NET_IF_CFG_WAIT_SETUP_READY_EN == DEF_ENABLED)
    NET_IF_APP_INFO if_app_info;
                                                                /* -------- WAIT FOR INTEFACE SETUP TO FINISH --------- */
    printf("eth0: Waiting for interface to be ready\n");
    NetIF_WaitSetupReady(if_nbr, &if_app_info, 0, &err);
    printf("eth0: interface ready\n");
    APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE), ;);
#endif
}


