EbadSyed/v2.1/app/mcu_example/SLSTK3701A_EFM32GG11/micriumos_net/net/core/ex_net_core.c
/*
*********************************************************************************************************
*                                       Ex_Net_CoreStartEther()
*
* Description : Start an Ethernet Interface.
*
* Argument(s) : None.
*
* Return(s)   : None.
*
* Note(s)     : (1) In this example no NET_IF_ETHER_CFG structure is passed to the start function.
*                   Therefore, no address setup is done by the start function and it must be done
*                   explicitly with DHCP client, IPv4 and IPv6 API calls, and after the call to
*                   NetIF_Ether_Start().
*********************************************************************************************************
*/
#ifdef  RTOS_MODULE_NET_IF_ETHER_AVAIL
void  Ex_Net_CoreStartEther (void)
{
    NET_IF_NBR      if_nbr;
    RTOS_ERR        err;
#if (NET_IPv4_CFG_EN == DEF_ENABLED)
    NET_IPv4_ADDR   addr_ipv4;
    NET_IPv4_ADDR   msk_ipv4;
    NET_IPv4_ADDR   gateway_ipv4;
#endif
#if  (NET_IPv6_CFG_EN == DEF_ENABLED)
    CPU_BOOLEAN     cfg_result  = DEF_FAIL;
    NET_FLAGS       ipv6_flags;
    NET_IPv6_ADDR   addr_ipv6;
#endif

                                                                /* --- RECOVER INTERFACE NUMBER FROM INTEFACE NAME ---- */
    if_nbr = NetIF_NbrGetFromName("eth0");
    APP_RTOS_ASSERT_CRITICAL((if_nbr != NET_IF_NBR_NONE), ;);

                                                                /* ------------- START ETHERNET INTERFACE ------------- */
    NetIF_Ether_Start(if_nbr, DEF_NULL, &err);
    APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE), ;);


#if (NET_IPv4_CFG_EN == DEF_ENABLED)
                                                                /* ----- ENABLE DHCP PROCESS ON NETWORK INTEFACE ------ */
#if (NET_DHCP_CLIENT_CFG_MODULE_EN == DEF_ENABLED)                                                                  
    DHCPc_IF_Add(if_nbr, DEF_NULL, Ex_DHCPc_Hook, &err);
    APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE), ;);
#endif

                                                                /* --------- CONFIGURE IPV4 STATIC ADDRESSES ---------- */
    /* TODO Update IPv4 Address, Mask and Gateway below following your network requirements. */

                                                                /* Convert Host IPv4 string address to 32 bit address.  */
    NetASCII_Str_to_IP("10.10.10.64",
                       &addr_ipv4,
                        NET_IPv4_ADDR_SIZE,
                       &err);
    APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE), ;);

    NetASCII_Str_to_IP("255.255.255.0",                         /* Convert IPv4 mask string to 32 bit address.          */
                       &msk_ipv4,
                        NET_IPv4_ADDR_SIZE,
                       &err);
    APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE), ;);

    NetASCII_Str_to_IP("10.10.10.1",                            /* Convert Gateway string address to 32 bit address.    */
                       &gateway_ipv4,
                        NET_IPv4_ADDR_SIZE,
                       &err);
    APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE), ;);

    NetIPv4_CfgAddrAdd(if_nbr,                                  /* Add a statically-configured IPv4 host address,   ... */
                       addr_ipv4,                               /* ... subnet mask, & default gateway to the        ... */
                       msk_ipv4,                                /* ... interface.                                       */
                       gateway_ipv4,
                      &err);
    APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE), ;);
#endif /* NET_IPv4_CFG_EN */


#if  (NET_IPv6_CFG_EN == DEF_ENABLED)

                                                                /* Set hook function to received addr cfg result.       */
    NetIPv6_AddrSubscribe(&Ex_IPv6_AddrCfgResult, &err);
    APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE), ;);

#if  (NET_IPv6_CFG_ADDR_AUTO_CFG_EN == DEF_ENABLED)
                                                                /* ----- ENABLE IPV6 STATELESS AUTO-CONFIGURATION ----- */

    cfg_result = NetIPv6_AddrAutoCfgEn(if_nbr,                  /* Enable and Start Auto-Configuration process.         */
                                       DEF_YES,
                                      &err);
    APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE), ;);
#endif
                                                                /* ----- CONFIGURE IPV6 STATIC LINK LOCAL ADDRESS ----- */
                                                                /* DHCPv6c is not yet available.                        */


    /* TODO Update IPv6 Address below following your network requirements. */

                                                                /* Convert IPv6 string address to 128 bit address.      */
    NetASCII_Str_to_IP("fe80::1111:1111",
                       &addr_ipv6,
                        NET_IPv6_ADDR_SIZE,
                       &err);
    APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE), ;);

    ipv6_flags = 0;
    DEF_BIT_SET(ipv6_flags, NET_IPv6_FLAG_DAD_EN);              /* Enable DAD with Address Configuration.               */

    NetIPv6_CfgAddrAdd(if_nbr,                                  /* Add a statically-configured IPv6 host address to ... */
                      &addr_ipv6,                               /* ... the interface.                                   */
                       64,
                       ipv6_flags,
                      &err);
    APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE), ;);

    PP_UNUSED_PARAM(cfg_result);
#endif  /* NET_IPv6_CFG_EN */
}
#endif


/*
*********************************************************************************************************
*********************************************************************************************************
*                                           LOCAL FUNCTIONS
*********************************************************************************************************
*********************************************************************************************************
*/

