EbadSyed/v2.1/app/mcu_example/SLSTK3701A_EFM32GG11/micriumos_net/net/core/ex_net_core.c
/*
*********************************************************************************************************
*                                          Ex_IPv6_AddrCfgResult()
*
* Description : Hook function to received any IPv6 address configuration process result.
*
* Argument(s) : if_nbr           Network Interface number on which address configuration occurred.
*
*               addr_type        IPv6 address type:
*
*                                   NET_IPv6_CFG_ADDR_TYPE_STATIC
*                                   NET_IPv6_CFG_ADDR_TYPE_AUTO_CFG_LINK_LOCAL
*                                   NET_IPv6_CFG_ADDR_TYPE_AUTO_CFG_GLOBAL
*
*               p_addr_cfgd      Pointer to IPv6 address configured, if any.
*                                DEF_NULL, otherwise.
*
*               addr_cfg_status  Result status of the IPv6 address configuration process:
*
*                                   NET_IPv6_ADDR_CFG_STATUS_SUCCEED
*                                   NET_IPv6_ADDR_CFG_STATUS_FAIL
*                                   NET_IPv6_ADDR_CFG_STATUS_DUPLICATE
*
* Return(s)   : None.
*
* Note(s)     : None.
*********************************************************************************************************
*/
#ifdef  EX_NET_CORE_IF_EXT_EN
static  void  Ex_IPv6_AddrCfgResult (       NET_IF_NBR                 if_nbr,
                                            NET_IPv6_CFG_ADDR_TYPE     addr_type,
                                     const  NET_IPv6_ADDR             *p_addr_cfgd,
                                            NET_IPv6_ADDR_CFG_STATUS   addr_cfg_status)
{
    CPU_CHAR   ip_string[NET_ASCII_LEN_MAX_ADDR_IPv6];
    RTOS_ERR   err;


    PP_UNUSED_PARAM(if_nbr);

    if (p_addr_cfgd != DEF_NULL) {
        NetASCII_IPv6_to_Str((NET_IPv6_ADDR *)p_addr_cfgd, ip_string, DEF_NO, DEF_NO, &err);
        APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE), ;);
        EX_TRACE("IPv6 Address Link Local: %s\n", ip_string);
    }

    switch (addr_type) {
        case NET_IPv6_CFG_ADDR_TYPE_STATIC:
             switch (addr_cfg_status) {
                 case NET_IPv6_ADDR_CFG_STATUS_SUCCEED:
                      EX_TRACE("IPv6 Address Static: %s, configured successfully\n", ip_string);
                      break;

                 case NET_IPv6_ADDR_CFG_STATUS_DUPLICATE:
                      EX_TRACE("IPv6 Address Static already exists on the network\n");
                      break;

                 default:
                      EX_TRACE("IPv6 Address Static configuration failed.\n");
                      break;
             }
             break;

        case NET_IPv6_CFG_ADDR_TYPE_AUTO_CFG_LINK_LOCAL:
             switch (addr_cfg_status) {
                 case NET_IPv6_ADDR_CFG_STATUS_SUCCEED:
                      EX_TRACE("IPv6 Address Link Local: %s, configured successfully\n", ip_string);
                      break;

                 case NET_IPv6_ADDR_CFG_STATUS_DUPLICATE:
                      EX_TRACE("IPv6 Address Link Local already exists on the network\n");
                      break;

                 default:
                     printf("IPv6 Address Link Local configuration failed.\n");
                     break;
             }
             break;

        case NET_IPv6_CFG_ADDR_TYPE_AUTO_CFG_GLOBAL:
             switch (addr_cfg_status) {
                 case NET_IPv6_ADDR_CFG_STATUS_SUCCEED:
                      EX_TRACE("IPv6 Address Global: %s, configured successfully\n", ip_string);
                      break;

                 case NET_IPv6_ADDR_CFG_STATUS_DUPLICATE:
                      EX_TRACE("IPv6 Address Global already exists on the network\n");
                      break;

                 default:
                      EX_TRACE("IPv6 Address Global configuration failed.\n");
                      break;
             }
             break;

        default:
             break;
    }
}
#endif


/*
*********************************************************************************************************
*                                        Ex_DHCPc_SetupResult()
*
* Description : Hook function called when DHCP process has been complete on an network interface.
*
* Argument(s) : if_nbr      Network Interface number on which DHCP process occurred.
*
*               status      DHCP process status:
*
*                               DHCPc_STATUS_SUCCESS
*                               DHCPc_STATUS_FAIL_ADDR_USED
*                               DHCPc_STATUS_FAIL_OFFER_DECLINE
*                               DHCPc_STATUS_FAIL_NAK_RX
*                               DHCPc_STATUS_FAIL_NO_SERVER
*                               DHCPc_STATUS_FAIL_ERR_FAULT
*
*               addr        IPv4 address configured, if any.
*                           Else, NET_IPv4_ADDR_NONE.
*
*               mask        IPv4 mask configured, if any.
*                           Else, NET_IPv4_ADDR_NONE.
*
*               gateway     IPv4 gateway configured, if any.
*                           Else, NET_IPv4_ADDR_NONE.
*
*               err         Error object in case an error occurred.
*                           Else, RTOS_ERR_NONE.
*
* Return(s)   : None.
*
* Note(s)     : None.
*********************************************************************************************************
*/
#ifdef  EX_NET_CORE_IF_EXT_EN
static  void  Ex_DHCPc_SetupResult (NET_IF_NBR     if_nbr,
                                    DHCPc_STATUS   status,
                                    NET_IPv4_ADDR  addr,
                                    NET_IPv4_ADDR  mask,
                                    NET_IPv4_ADDR  gateway,
                                    RTOS_ERR       err)
{
    CPU_CHAR   addr_string[NET_ASCII_LEN_MAX_ADDR_IPv4];
    CPU_CHAR   mask_string[NET_ASCII_LEN_MAX_ADDR_IPv4];
    CPU_CHAR   gateway_string[NET_ASCII_LEN_MAX_ADDR_IPv4];
    RTOS_ERR   local_err;


    PP_UNUSED_PARAM(if_nbr);

    switch (status) {
        case DHCPc_STATUS_SUCCESS:
             NetASCII_IPv4_to_Str(addr, addr_string, DEF_NO, &local_err);
             APP_RTOS_ASSERT_CRITICAL((local_err.Code == RTOS_ERR_NONE), ;);

             NetASCII_IPv4_to_Str(mask, mask_string, DEF_NO, &local_err);
             APP_RTOS_ASSERT_CRITICAL((local_err.Code == RTOS_ERR_NONE), ;);

             NetASCII_IPv4_to_Str(gateway, gateway_string, DEF_NO, &local_err);
             APP_RTOS_ASSERT_CRITICAL((local_err.Code == RTOS_ERR_NONE), ;);

