EbadSyed/v2.1/app/mcu_example/SLSTK3701A_EFM32GG11/micriumos_net/net/core/ex_net_core.c
             EX_TRACE("DHCP client process succeeded.\n");
             EX_TRACE("IP address configured : %s .\n", addr_string);
             EX_TRACE("IP address mask       : %s .\n", mask_string);
             EX_TRACE("IP address gateway    : %s .\n", gateway_string);
             break;

        case DHCPc_STATUS_FAIL_ADDR_USED:
             EX_TRACE("DHCP client process failed: Address already used on network.\n");
             break;

        case DHCPc_STATUS_FAIL_OFFER_DECLINE:
             EX_TRACE("DHCP client process failed: DHCP client declined the offer.\n");
             break;

        case DHCPc_STATUS_FAIL_NAK_RX:
             EX_TRACE("DHCP client process failed: The DHCP server refused the client.\n");
             break;

        case DHCPc_STATUS_FAIL_NO_SERVER:
             EX_TRACE("DHCP client process failed: No DHCP server was detected on the network.\n");
             break;

        case DHCPc_STATUS_FAIL_ERR_FAULT:
#if ((RTOS_ERR_CFG_EXT_EN == DEF_ENABLED) && \
     (RTOS_ERR_CFG_STR_EN == DEF_ENABLED))
             EX_TRACE("DHCP client process failed: Fatal error %s.\n", err.CodeText);
#else
             EX_TRACE("DHCP client process failed: Fatal error %i.\n", err.Code);
#endif
             break;

        default:
             EX_TRACE("DHCP client invalid result.\n");
             return;
    }

#if ((NET_IPv4_CFG_EN            == DEF_ENABLED) && \
     (NET_IPv4_CFG_LINK_LOCAL_EN == DEF_ENABLED))
    if (status != DHCPc_STATUS_SUCCESS) {
        NetIPv4_AddrLinkLocalCfg(if_nbr, Ex_IPv4_LinkLocalAddrCfgResult, &local_err);
    }
#endif
}
#endif


static void  Ex_MacAddrGet(CPU_CHAR * addr_mac_str)
{
    CPU_INT08U         addr_mac[NET_IF_802x_HW_ADDR_LEN];
    RTOS_ERR           err;

    if (DEVINFO->EUI48L != 0xFFFFFFFF) {
      addr_mac[0] = DEVINFO->EUI48H >> 8;
      addr_mac[1] = DEVINFO->EUI48H >> 0;
      addr_mac[2] = DEVINFO->EUI48L >> 24;
      addr_mac[3] = DEVINFO->EUI48L >> 16;
      addr_mac[4] = DEVINFO->EUI48L >> 8;
      addr_mac[5] = DEVINFO->EUI48L >> 0;
    } else {
      addr_mac[0] = DEVINFO->UNIQUEH >> 24;
      addr_mac[1] = DEVINFO->UNIQUEH >> 16;
      addr_mac[2] = DEVINFO->UNIQUEH >> 8;
      addr_mac[3] = DEVINFO->UNIQUEL >> 16;
      addr_mac[4] = DEVINFO->UNIQUEL >> 8;
      addr_mac[5] = DEVINFO->UNIQUEL >> 0;
    }

    NetASCII_MAC_to_Str(addr_mac, addr_mac_str, DEF_FALSE, DEF_TRUE, &err);
}

/*
*********************************************************************************************************
*********************************************************************************************************
*                                   DEPENDENCIES & AVAIL CHECK(S) END
*********************************************************************************************************
*********************************************************************************************************
*/

#endif  /* RTOS_MODULE_NET_AVAIL */

